In [10]:
import pandas as pd
import numpy as np

In [4]:
data2 = {'name':pd.Series(['강감찬','이순신','홍길동','김자바','이자바','홍자바','안자바']),
         'age': pd.Series([33, 23, 45, 34, 44, 39, 56]),
         'salary':pd.Series([200,300,400,500,600,700,1000])}
df2 = pd.DataFrame(data2)
df2

  name  age  salary
0  강감찬   33     200
1  이순신   23     300
2  홍길동   45     400
3  김자바   34     500
4  이자바   44     600
5  홍자바   39     700
6  안자바   56    1000

In [6]:
df3 = df2.reindex(index=[0,2,5],columns=['name','salary','grade'])
df3

  name  salary  grade
0  강감찬     200    NaN
2  홍길동     400    NaN
5  홍자바     700    NaN

In [7]:
df4 = pd.DataFrame(np.random.randn(10,3), columns=['col1','col2','col3'])
df5 = pd.DataFrame(np.random.randn(7,3), columns=['col1','col2','col3'])

In [8]:
df4

       col1      col2      col3
0  0.673771  0.030837  1.578095
1 -0.224372  0.599455  0.894887
2 -0.050710  1.597494  0.028971
3  0.491156 -2.117701  1.343641
4  0.502838  0.216177 -0.737353
5  0.351073  1.429529 -1.316371
6  1.053924  3.084307  1.272822
7 -0.800700 -0.633049 -0.115920
8  0.237114  0.414427 -0.470155
9 -0.108229  0.932796  0.769201

In [10]:
df4.reindex_like(df5)

       col1      col2      col3
0  0.673771  0.030837  1.578095
1 -0.224372  0.599455  0.894887
2 -0.050710  1.597494  0.028971
3  0.491156 -2.117701  1.343641
4  0.502838  0.216177 -0.737353
5  0.351073  1.429529 -1.316371
6  1.053924  3.084307  1.272822

In [11]:
df5.reindex_like(df4) # 결측치를 무엇으로 채울까?

       col1      col2      col3
0 -0.208538 -0.396501  0.050229
1 -0.169368  0.626273 -0.748456
2 -0.674552 -0.974378  0.122602
3  1.646559 -1.260636  1.276568
4  0.271105  1.019527  1.725406
5  0.767609  1.551765  0.338006
6 -1.034951 -0.665008 -0.181750
7       NaN       NaN       NaN
8       NaN       NaN       NaN
9       NaN       NaN       NaN

In [12]:
df5.reindex_like(df4, method='ffill')

       col1      col2      col3
0 -0.208538 -0.396501  0.050229
1 -0.169368  0.626273 -0.748456
2 -0.674552 -0.974378  0.122602
3  1.646559 -1.260636  1.276568
4  0.271105  1.019527  1.725406
5  0.767609  1.551765  0.338006
6 -1.034951 -0.665008 -0.181750
7 -1.034951 -0.665008 -0.181750
8 -1.034951 -0.665008 -0.181750
9 -1.034951 -0.665008 -0.181750

In [14]:
import time
import numpy as np
import pandas as pd
import requests
from bs4 import BeautifulSoup
URL = "http://ticket2.movie.daum.net/Movie/MovieRankList.aspx"
res = requests.get(URL)
soup = BeautifulSoup(res.content, 'lxml')
box = soup.find_all('div', class_="desc_boxthumb")
count = 0
data = []
for movie in box:  
    title, ranking = movie.find('strong', class_="tit_join"), movie.find('em', class_="emph_grade")
    movie, grade = title.get_text().strip(), ranking.get_text().strip()
    # print(movie, grade)
    list = [movie, grade]
    data.append(list)
    count += 1

df = pd.DataFrame(data,columns=['title','rating'])
df['rating'] = df['rating'].astype(float)
df.dtypes
df['rating'].mean()

7.639999999999999

In [26]:
df = pd.read_csv("../data/billboard.csv")
print(">",df.shape)
print(">",df.dtypes)
print(">",df.columns)
print(">",df.index)
df.describe()

> (317, 81)
> year              int64
artist           object
track            object
time             object
date.entered     object
                 ...
wk72            float64
wk73            float64
wk74            float64
wk75            float64
wk76            float64
Length: 81, dtype: object
> Index(['year', 'artist', 'track', 'time', 'date.entered', 'wk1', 'wk2', 'wk3',
       'wk4', 'wk5', 'wk6', 'wk7', 'wk8', 'wk9', 'wk10', 'wk11', 'wk12',
       'wk13', 'wk14', 'wk15', 'wk16', 'wk17', 'wk18', 'wk19', 'wk20', 'wk21',
       'wk22', 'wk23', 'wk24', 'wk25', 'wk26', 'wk27', 'wk28', 'wk29', 'wk30',
       'wk31', 'wk32', 'wk33', 'wk34', 'wk35', 'wk36', 'wk37', 'wk38', 'wk39',
       'wk40', 'wk41', 'wk42', 'wk43', 'wk44', 'wk45', 'wk46', 'wk47', 'wk48',
       'wk49', 'wk50', 'wk51', 'wk52', 'wk53', 'wk54', 'wk55', 'wk56', 'wk57',
       'wk58', 'wk59', 'wk60', 'wk61', 'wk62', 'wk63', 'wk64', 'wk65', 'wk66',
       'wk67', 'wk68', 'wk69', 'wk70', 'wk71', 'wk72', 'wk73', 'wk74', 'wk75',
       'wk76'],
      dtype='object')
> RangeIndex(start=0, stop=317, step=1)

,year,wk1,wk2,wk3,wk4,wk5,wk6,wk7,wk8,wk9,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
count,317.0,317.000000,312.000000,307.000000,300.000000,292.000000,280.000000,269.000000,260.000000,253.000000,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
mean,2000.0,79.958991,71.173077,65.045603,59.763333,56.339041,52.360714,49.219331,47.119231,46.343874,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.0,14.686865,18.200443,20.752302,22.324619,23.780022,24.473273,25.654279,26.370782,27.136419,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,2000.0,15.000000,8.000000,6.000000,5.000000,2.000000,1.000000,1.000000,1.000000,1.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,2000.0,74.000000,63.000000,53.000000,44.750000,38.750000,33.750000,30.000000,27.000000,26.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,2000.0,81.000000,73.000000,66.000000,61.000000,57.000000,51.500000,47.000000,45.500000,42.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,2000.0,91.000000,84.000000,79.000000,76.000000,73.250000,72.250000,67.000000,67.000000,67.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,2000.0,100.000000,100.000000,100.000000,100.000000,100.000000,99.000000,100.000000,99.000000,100.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
df2 = df.reindex(index=[0,1,2], columns=['time','artist','year'])
df2

   time        artist  year
0  4:22         2 Pac  2000
1  3:15       2Ge+her  2000
2  3:53  3 Doors Down  2000

In [32]:
df3 = pd.DataFrame(np.random.randn(6,3), columns=['c1','c2','c3'])
df4 = df3.rename(index = {0:100,1:200,2:300,3:400,4:500,5:600}, columns={'c1':'one','c2':'two','c3':'three'})
df4

          one       two     three
100  0.597492  0.502067 -0.053564
200  0.421295 -0.409383 -2.154995
300 -0.016697  0.395271  0.789551
400  0.600965  1.299508 -1.097878
500  1.556413  2.766104  0.378918
600 -0.419638  0.076887  0.697766

In [44]:
df = pd.DataFrame(np.random.randn(6,4), index = ['a','b','c','d','e','f'],columns = ['c1','c2','c3','c4'])
print(">\n",df.loc['a'])
print(">\n",df.loc[:,['c1','c3']])
print(">\n",df.loc[['a','c','e'],['c1','c3']])
print(">\n",df.loc['a':'d','c1':'c4'])
print(">\n",df.loc['a']>0)
df

>
 c1   -1.769653
c2   -0.603054
c3    0.839545
c4    0.272604
Name: a, dtype: float64
>
          c1        c3
a -1.769653  0.839545
b  0.745533  1.357864
c  0.614613 -0.492843
d  0.066587  0.207006
e -0.256170  0.394502
f  0.282699  1.023546
>
          c1        c3
a -1.769653  0.839545
c  0.614613 -0.492843
e -0.256170  0.394502
>
          c1        c2        c3        c4
a -1.769653 -0.603054  0.839545  0.272604
b  0.745533  2.008709  1.357864  0.907540
c  0.614613  1.478953 -0.492843  0.944599
d  0.066587  0.984656  0.207006 -0.761297
>
 c1    False
c2    False
c3     True
c4     True
Name: a, dtype: bool

         c1        c2        c3        c4
a -1.769653 -0.603054  0.839545  0.272604
b  0.745533  2.008709  1.357864  0.907540
c  0.614613  1.478953 -0.492843  0.944599
d  0.066587  0.984656  0.207006 -0.761297
e -0.256170 -0.913173  0.394502 -0.116765
f  0.282699  0.004691  1.023546  0.632953

In [48]:
df2 = pd.DataFrame(np.random.randn(6,4), index = ['a','b','c','d','e','f'],columns = ['c1','c2','c3','c4'])
print(">\n",df2.iloc[1:3,1:2])
print(">\n",df2.iloc[0:2,0:2])
print(">\n",df2['c1'][:2])
df2

>
          c2
b -1.610481
c -0.779630
>
          c1        c2
a  0.713557 -0.039796
b  1.678572 -1.610481
>
 a    0.713557
b    1.678572
Name: c1, dtype: float64

         c1        c2        c3        c4
a  0.713557 -0.039796  0.015147 -0.738644
b  1.678572 -1.610481 -0.555015  0.750117
c -0.276756 -0.779630  0.895287 -1.177343
d -0.541233 -0.385336 -0.228637  0.313506
e  0.806063  2.111903  2.335620 -0.834924
f  0.025627  1.780263 -0.936592  0.329808